Revit 2027 API
ConstraintToRebarEdgeProperties Methods
The ConstraintToRebarEdgeProperties type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetTargetRebarEdge |  Gets the target rebar edge.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ConstraintToRebarEdgeProperties Class
Autodesk.Revit.DB.Structure Namespace